from sympy import *
import math
# import numpy
# 依据刀具设计原理与计算一书 第353页
""" 
阿基米德蜗杆的特点是它的轴向截型是直线.就是纵切面是直线
端面截型是阿基米德螺线, 就是横切面是阿基米德螺旋线
下面定义一写参变量
ax ----- 蜗杆轴向齿形角
r ----- 蜗杆分度圆半径
ex ----- 蜗杆分度圆上轴向齿槽宽
为了计算盘状刀具刃型, 要一致蜗杆的下列参数
m ----- 蜗杆轴向模数(或者涡轮端面模数)
z1 ----- 蜗杆头数
da = 2 * ra ----- 蜗杆外径  (相当于齿顶圆)
df = 2 * rf ----- 蜗杆根径  (相当于齿根圆)
d = 2 * r ----- 蜗杆分度圆半径
γ ----- 蜗杆分度圆上螺旋形升角
Sx ----- 蜗杆分度圆柱上轴向齿厚 (看起来像梯形中位线的那条线)
C ----- 径向间隙
"""
# 定义参变量
from sympy.abc import u, x, y, z
# 定义符号变量
ax, r, ex = symbols("ax r ex")
m, da, df, C, γf, γ = symbols("m da df C γf γ")
# 根据计算得出的符号变量
ra = da / 2
rf = df / 2
# 定义刀具参数
a, r0, Σ = symbols("a r0 Σ")
# !计算说明书
""" 
1. 计算选点 B, F, K 点
   B点: 在蜗杆外径上 rB = ra 
   F点: 在蜗杆分度圆上 rF = r
   K点: 比蜗杆根径大一个径向间隙的圆山 rK = rf  + C
   δy = - x3 / P
   tanξy = - r / P * tan(ax)
   cosξy = 1 / sqrt(1 + tanξy ** 2)
   sinξy = tanξy * cosξy 
"""
rB = ra
rF = r
rK = rf + C

""" 
2. 确定安装参数
   公式1
   a = (da / 2 - aPmax) +/- d0 = 1/2(df +/- d0)
   其中: da ---- 工件外径
        df ----- 工件根径
        aPmax ----- 工件端面截型最大深度
        d0 = 2 * r0 ----- 刀具最大外径
    有 +/- 符号的地方, 上面的符号用于加工外螺旋面, 下面的符号用于加工内螺旋面
    具体选择参见 刀具设计原理与计算 P344
   (1). 轴间距 a 由公式1 决定
        取 d0 = 2 * r0 得 a = 1/2 (d0 + df)
        
"""
d0 = 2 * r0
a = 1/2 * (d0 + df)
""" 
轴交角 Σ

"""


Σ = 1/2 * (γf + γ)

# 测试程序
if __name__ == "__main__":
    m = 10
    z1 = 4
    da = 100
    __df = 60.6
    __rf = __df / 2
    d = 80
    __r = d / 2
    ax = 20  # 度数 math.radians()
    __γ = 26.565  # 度数
    Sx = 15.07079
    C = 1.8
    P = m * z1 / 2 * tan(γ)
    d0 = 120
    __r0 = d0 / 2
    #  代入数字进行计算
    __a = a.subs({df: __df, r0: __r0})
    print("a =", a, "= ", __a,  "//轴间距a")
    # 求出 __γf (γf) 的角度值
    __tan_γf = (__r * tan(math.radians(__γ)) / __rf)
    __γf = math.degrees(atan(__tan_γf))
    __Σ = Σ.subs({γf: __γf, γ:__γ})
    print("Σ = ",  Σ, "=", __Σ,  "// 轴交角 Σ, 角度值")
