import numpy as np

a1 = np.array([[1, 1],
               [2, 2]])
a2 = np.array([[3, 3],
               [4, 4]])

# 垂直堆叠
c1v = np.vstack((a1, a2))
print(c1v)

# 水平堆叠
c1h = np.hstack((a1, a2))
print(c1h)

# 一维数组拆分
x = np.arange(1, 25).reshape(2, 12)
print(x)
"""  
这样拆分, 变成了3维数组
[[ 1  2  3  4 | 5  6  7  8  | 9 10 11 12]
 [13 14 15 16 | 17 18 19 20 | 21 22 23 24]]
  ---> 
[
    array([[ 1,  2,  3,  4], [13, 14, 15, 16]]), 
    array([[ 5,  6,  7,  8], [17, 18, 19, 20]]), 
    array([[ 9, 10, 11, 12], [21, 22, 23, 24]])
]
"""
print(np.hsplit(x, 3))
"""  
这样拆分,  在第3 和第4列之间拆分
[[ 1  2  3 |  4 | 5  6    7  8   9   10 11 12]
 [13 14 15 | 16 | 17 18   19 20  21   22 23 24]]
  ---> 
[
    array([[ 1,  2,  3], [13, 14, 15]]), 
    array([
          [4],[16]
        ]), 
    array([
          [ 5,  6,  7,  8,  9, 10, 11, 12],
          [17, 18, 19, 20, 21, 22, 23, 24]])
        ]
"""
print(np.hsplit(x, (3, 4)))




